> ```terraform
> scope  = data.azurerm_subscription.primary.id
> ```

Gave this a shot.  Terraform still planned for replacement....

Code Update
```

data "azurerm_subscription" "primary" {
}

resource "azurerm_role_assignment" "storage-role" {

  scope              = data.azurerm_subscription.primary.id

  role_definition_id = data.azurerm_role_definition.storage-role.id

  principal_id       = data.azuread_group.aad-group.object_id
}
```

Terraform's Replacement Plan

```
  # azurerm_role_assignment.storage-role must be replaced
-/+ resource "azurerm_role_assignment" "storage-role" {
      ~ id                               = "/subscriptions/0f849332-18f0-45f6-abf6-3bcd9058d3eb/resourceGroups/virtual-desktop-storage/providers/Microsoft.Storage/storageAccounts/avddesktopekj4/providers/Microsoft.Authorization/roleAssignments/a3fb7639-127a-9f6c-9c21-587b097f2b3a" -> (known after apply)
      ~ name                             = "a3fb7639-127a-9f6c-9c21-587b097f2b3a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/0f849332-18f0-45f6-abf6-3bcd9058d3eb/providers/Microsoft.Authorization/roleDefinitions/0c867c2a-1d8c-454a-a3db-ab2ea1bdc8bb" -> "/providers/Microsoft.Authorization/roleDefinitions/0c867c2a-1d8c-454a-a3db-ab2ea1bdc8bb" # forces replacement
      ~ role_definition_name             = "Storage File Data SMB Share Contributor" -> (known after apply)
      ~ scope                            = "/subscriptions/0f849332-18f0-45f6-abf6-3bcd9058d3eb/resourceGroups/virtual-desktop-storage/providers/Microsoft.Storage/storageAccounts/avddesktopekj4" -> "/subscriptions/0f849332-18f0-45f6-abf6-3bcd9058d3eb" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }
```